html/thoughts-on-youtube.html
<!doctype html>
<html lang="en">
<head>
<title>Thoughts on YouTube</title>
<!-- 2021-06-14 Mon 21:29 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Russel Arbore">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Pros</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. Unrivaled library of great, free content</a></li>
<li><a href="#sec-1-2">1.2. Great community</a></li>
<li><a href="#sec-1-3">1.3. Education</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Cons</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. Google</a></li>
<li><a href="#sec-2-2">2.2. The YouTube algorithm</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Thoughts on YouTube</h1>
<p>
After using YouTube for quite some time, I&rsquo;ve harbored mixed opinions of the site. Other than YouTube, I generally stay off of social media (which I believe has been to my benefit). YouTube, like all things in life, is neither completely good nor bad. Each individual should consider the upsides and downsides of not only YouTube, but of any site before adding said site to one&rsquo;s instinctual routine.
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Pros</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Unrivaled library of great, free content</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This element is pretty obvious - there is such a wide variety of high quality content on YouTube that no other platform can match. There&rsquo;s something for everybody.
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Great community</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Many of the YouTubers who actually create content have a unique ability to connect with their audiences. YouTube (can be) a great place to find <i>authentic</i> creators.
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Education</h3>
<div class="outline-text-3" id="text-1-3">
<p>
I can confidently say I&rsquo;ve learned more (in <i>all</i> facets of life) from YouTube than all other sources, combined. YouTube is an excellent place to jump-start your learning into a new subject and, depending on the popularity of the subject, dig deep into the details. YouTube is almost singlehandedly responsible for creating my current career path - I learned no computer science or programming from high school, for example.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Cons</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Google</h3>
<div class="outline-text-3" id="text-2-1">
<p>
YouTube is owned by Google. <a href="https://stallman.org/google.html">https://stallman.org/google.html</a>
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> The YouTube algorithm</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The most ethereal influence in the YouTube community is the YouTube algorithm, which decides what videos to recommend to millions of users around the world. I haven&rsquo;t had an overall positive experience with this algorithm. I often find myself looking for videos to watch, scrolling through pages of recommendations without finding anything interesting. I&rsquo;ve remedied this by subscribing to a large amount of channels that I know create interesting content.
</p>
</div>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Russel Arbore</p>
<p class="date">Created: 2021-06-14 Mon 21:29</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 27.2 (<a href="http://orgmode.org">Org-mode</a> 9.5)</p>
</div>
</footer>
</body>
</html>
